<!-- dflook/terraform-github-actions {"workspace":"version-v-prefix","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"5082f0fea3a9597cc14ec97256cd8d549edbc5609385c74d2211d9f3564928ac","plan_job_ref":"Job Test plan target and replace #422 at https://github.com/dflook/terraform-github-actions/actions/runs/9274433193","plan_hash":"fcaaec5ccade87558ecb21680fb338189544d31c326a99a7c5bf185c6e64395b","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __version-v-prefix__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "5hy6K98YDs" -> (known after apply)
!~  foreach = "GrhGivSCNY" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #422](https://github.com/dflook/terraform-github-actions/actions/runs/9274433193)